package com.company.uaa;

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        // write your code here
        /*5. написать программу, которая считывает число,
        введенное пользователем из консоли и выводит его  звездочками в консоль: ввожу 721
        вижу в консоли звездочками отрисованное число 721.
        число должно напоминать цифры для написания почтового индекса на конвертах )*/

        //сделал только для цифр от  0 до 4

        int dig[][][] = {
                {
                        {0, 1, 1, 1, 1, 1, 1, 0},
                        {0, 1, 0, 0, 0, 0, 1, 0},
                        {0, 1, 0, 0, 0, 0, 1, 0},
                        {0, 1, 0, 0, 0, 0, 1, 0},
                        {0, 1, 0, 0, 0, 0, 1, 0},
                        {0, 1, 0, 0, 0, 0, 1, 0},
                        {0, 1, 1, 1, 1, 1, 1, 0},
                },
                {
                        {0, 0, 0, 0, 0, 1, 1, 0},
                        {0, 0, 0, 0, 1, 0, 1, 0},
                        {0, 0, 0, 1, 0, 0, 1, 0},
                        {0, 0, 1, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                },
                {
                        {0, 1, 1, 1, 1, 1, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 1, 0, 0, 0},
                        {0, 0, 0, 1, 0, 0, 0, 0},
                        {0, 0, 1, 0, 0, 0, 0, 0},
                        {0, 1, 1, 1, 1, 1, 0, 0},

                },
                {
                        {0, 1, 1, 1, 1, 1, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 1, 1, 1, 1, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0},
                        {0, 1, 1, 1, 1, 1, 1, 0},

                },
                {
                        {0, 1, 0, 0, 0, 1, 0, 0},
                        {0, 1, 0, 0, 0, 1, 0, 0},
                        {0, 1, 0, 0, 0, 1, 0, 0},
                        {0, 1, 1, 1, 1, 1, 0, 0},
                        {0, 0, 0, 0, 0, 1, 0, 0},
                        {0, 0, 0, 0, 0, 1, 0, 0},
                        {0, 0, 0, 0, 0, 1, 0, 0},

                }
        };

        Scanner s = new Scanner(System.in);
        System.out.println("Введите число, которое содержит числа от 0 до 4:");
        int numb = s.nextInt();
        // int numb = 4132;
        int count = String.valueOf(numb).length();
        int nM[] = new int[count];
        int k = count - 1;
        do {
            nM[k] = numb % 10;
            numb /= 10;
            k--;
        } while (numb != 0);



        for (int i = 0; i < dig[0].length; i++) {
            for (int in = 0; in < nM.length; in++) {
                if (nM[in]>4) {
                    System.out.println("Введены некорректные данные");
                    return;
                }
                else {
                for (int j = 0; j < dig[0][in].length; j++) {
                    if (dig[nM[in]][i][j] == 1) System.out.print("*");
                    else System.out.print(" ");
                }
            }
            }
            System.out.println();
        }
    }
}
